//cbcb  555555+
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Характерестика();
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.ФайлКартинки, "ДанныеКартинки");
КонецПроцедуры

&НаСервере
Процедура Характерестика()
	Тек = Справочники.ПараметрыКонтекстныхФункциональныхОпций.Контекст.ПолучитьОбъект();
	Если Объект.ИспользоватьХарактеристикиНоменклатуры Тогда
		Тек.ИспользоватьХарактеристикиНоменклатуры = Истина;
		Тек.Записать();
	Иначе 
		Тек.ИспользоватьХарактеристикиНоменклатуры = Ложь;
		Тек.Записать();
	КонецЕсли;	
	Элементы.ЦенаЗадаетсяНаХарактеристику.ТолькоПросмотр = ?(Объект.ИспользоватьХарактеристикиНоменклатуры,Ложь,Истина);
	//Объект.ЦенаЗадаетсяНаХарактеристику = ?(Объект.ИспользоватьХарактеристикиНоменклатуры,Истина);
	Если Не Объект.ИспользоватьХарактеристикиНоменклатуры Тогда 
		Объект.ЦенаЗадаетсяНаХарактеристику = Ложь;		
	КонецЕсли;
КонецПроцедуры // Характерестика()

&НаСервере
Процедура КатегорииТоваровПриИзмененииНаСервере()
	Объект.ИспользоватьХарактеристикиНоменклатуры = Объект.КатегорииТоваров.ИспользоватьХарактеристикиНоменклатуры;
	Объект.ЦенаЗадаетсяНаХарактеристику = Объект.КатегорииТоваров.ЦенаЗадаетсяНаХарактеристику;
	Характерестика();
	Структура = Новый Структура();
	УстановитьПараметрыФункциональныхОпцийФормы(Структура);
КонецПроцедуры

&НаКлиенте
Процедура КатегорииТоваровПриИзменении(Элемент)
	КатегорииТоваровПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФайлКартинкиПриИзмененииНаСервере()
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.ФайлКартинки, "ДанныеКартинки");
КонецПроцедуры

&НаКлиенте
Процедура ФайлКартинкиПриИзменении(Элемент)
	ФайлКартинкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура TestlarUchun(Команда)
	ЧислоШтрихкодов = 6;
	Предупреждение("%ЧислоШтрихкодов%",);
КонецПроцедуры
