Функция ПолучитьЦен(Номенклатура, Дата, КатегорияЦен) Экспорт
	Дата = ?(Дата = Неопределено, КонецДня(ТекущаяДата()) ,Дата);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПарамДата, ) КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
	|	И ЦеныНоменклатурыСрезПоследних.КатегорияЦен = &КатегорияЦен";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("КатегорияЦен", КатегорияЦен);
	Запрос.УстановитьПараметр("ПарамДата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Цена = 0;
	Пока Выборка.Следующий() Цикл
	
		Цена = Выборка.Цена;				
	
	КонецЦикла;
	Возврат Цена;
КонецФункции // ()
