
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад",Справочники.Организации.НайтиПоКоду(Объект.Код).Ссылка));
	//ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПриИзменении(Элемент)
	//УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад",Справочники.Организации.НайтиПоКоду(Объект.Код).Ссылка));
	//УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Ячейка",Объект.Ячейка));
	//ЭтаФорма.ОбновитьОтображениеДанных(Элементы);
КонецПроцедуры
