
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиКонтрагенту Кредит
	Движения.ОстаткиКонтрагенту.Записывать = Истина;
	Движение = Движения.ОстаткиКонтрагенту.Добавить();
	Движение.ВидДвижения = ВидДвиженияБухгалтерии.Кредит;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Плательщик;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаПлательщик;

	// регистр ОстаткиКонтрагенту Дебет
	Движения.ОстаткиКонтрагенту.Записывать = Истина;
	Движение = Движения.ОстаткиКонтрагенту.Добавить();
	Движение.ВидДвижения = ВидДвиженияБухгалтерии.Дебет;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Получатель;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаПолучатель;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
