
&НаКлиенте
Процедура МФОПриИзменении(Элемент)	
	//Объект.Банк = МхСпр.ПолучитБанка(Объект.МФО);
КонецПроцедуры

&НаКлиенте
Процедура ОКЭДПриИзменении(Элемент)
	//Объект.ОКЭДТури = МхСпр.ПолучитОКЭД(Объект.ОКЭД);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РаботаСоСправочниками.ПроверитьЭлемент(ЭтаФорма.Объект.Наименование, ЭтаФорма.Объект.Ссылка, Отказ);
	Если Отказ Тогда
	    Предупреждение("Такой элемент есть в справочнике", 10);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитИНН(Команда)
	//ОткрытьФорму("Справочник.Контрагент.Форма.Форма",,ЭтаФорма);
КонецПроцедуры
