
&НаКлиенте
Процедура СформироватьШтрихкод(Команда)
	
	Стр = Элементы.Список.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("СформироватьНовый", Истина);
	ПараметрыФормы.Вставить("Номенклатура"                 , Стр.Владелец);
	ПараметрыФормы.Вставить("Характеристика"               , Стр.Ссылка);
	//ПараметрыФормы.Вставить("ЕдиницаИзмерения"             , ЕдиницаИзмерения);
	//ПараметрыФормы.Вставить("ЗаблокироватьНоменклатуру"    , ЗначениеЗаполнено(Номенклатура));
	//ПараметрыФормы.Вставить("ЗаблокироватьХарактеристику"  , ЗначениеЗаполнено(ХарактеристикаНоменклатуры));
	//ПараметрыФормы.Вставить("ЗаблокироватьЕдиницуИзмерения", ЗначениеЗаполнено(ЕдиницаИзмерения));
	
	Если Стр.Штрихкод > 0 Тогда
		Предупреждение("Бу характерестика учун штрих код мавжуд",3);
	Иначе 	
		ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
