
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РеализацияТоварИУслуг.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоварИУслуг.Дата КАК Дата,
	|	РеализацияТоварИУслуг.Клиент КАК Клиент,
	|	РеализацияТоварИУслуг.Номер КАК Номер,
	|	РеализацияТоварИУслуг.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Номенклатура.Код КАК НоменклатураКод
	|	) КАК Товары,
	|	РеализацияТоварИУслуг.ТорговыйАгент КАК ТорговыйАгент
	|ИЗ
	|	Документ.РеализацияТоварИУслуг КАК РеализацияТоварИУслуг
	|ГДЕ
	|	РеализацияТоварИУслуг.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаТовар = Макет.ПолучитьОбласть("ШапкаТовар");
	Товар = Макет.ПолучитьОбласть("Товар");
	ПодвалТовар = Макет.ПолучитьОбласть("ПодвалТовар");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	СуммаДокумент = 0;
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		//ТабДок.Вывести(ОбластьЗаголовок);

		//Шапка.Параметры.Заполнить(Выборка);
		//Клиент = Справочники.Контрагенты.ПустаяСсылка();
		Шапка.Параметры.Клиент = Выборка.Клиент;
		Шапка.Параметры.Адрес = Выборка.Клиент.Адрес; 
		Шапка.Параметры.Дата = Выборка.Дата;
		Шапка.Параметры.Агент = Выборка.ТорговыйАгент;
		Шапка.Параметры.ТелНомер = Выборка.Клиент.НомерТелефона; 
		
		ТабДок.Вывести(Шапка);

		ТабДок.Вывести(ШапкаТовар);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			Товар.Параметры.НомерСтроки = ВыборкаТовары.НомерСтроки;
			Товар.Параметры.ТоварКод = ВыборкаТовары.НоменклатураКод; 
			Товар.Параметры.Товар = ВыборкаТовары.Номенклатура;  
			Товар.Параметры.Количество = ВыборкаТовары.Количество; 
			Товар.Параметры.Цена = ВыборкаТовары.Цена;  
			Товар.Параметры.Сумма = ВыборкаТовары.Сумма; 
			//ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(Товар);
			СуммаДокумент = СуммаДокумент + ВыборкаТовары.Сумма;
		КонецЦикла;
		ПодвалТовар.Параметры.СуммаДокумент = СуммаДокумент;
		ТабДок.Вывести(ПодвалТовар);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
