
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = Склад;
		Движение.Ячейка = ТекСтрокаТовары.Ячейка;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр ОстаткиКонтрагенту Дебет
	Движения.ОстаткиКонтрагенту.Записывать = Истина;
	Движение = Движения.ОстаткиКонтрагенту.Добавить();
	Движение.ВидДвижения = ВидДвиженияБухгалтерии.Дебет;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Клиент;
	Движение.Валюта = КатегорияЦен.ВалютаЦены;
	Движение.Сумма = Товары.Итог("Сумма");

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
