
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Себестоимость = МойМеханизм.ПолучитьЦен(Стр.Номенклатура,Объект.Дата,Объект.КатегорияЦенЗакупочная);
	Стр.СтараяЦена = МойМеханизм.ПолучитьЦен(Стр.Номенклатура,Объект.Дата,Объект.КатегорияЦен);
	Если Стр.СтараяЦена > 0 И Стр.Себестоимость > 0 Тогда 
		Стр.СтараяНаценка = (Стр.СтараяЦена / Стр.Себестоимость - 1) * 100;
	Иначе 
		Стр.СтараяНаценка = 0;		
	КонецЕсли;
	Если Стр.Цена > 0 И Стр.Себестоимость > 0 Тогда 
		Стр.Наценка = (Стр.Цена / Стр.Себестоимость - 1) * 100;				
	Иначе 
		Стр.Наценка = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КатегорияЦенПриИзмененииНаСервере()
	Объект.КатегорияЦенЗакупочная = Объект.КатегорияЦен.КатегорияЦенОснование;
КонецПроцедуры

&НаКлиенте
Процедура КатегорияЦенПриИзменении(Элемент)
	КатегорияЦенПриИзмененииНаСервере();
	РасчетТаблица();			
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТоварыНоменклатураПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаценкаПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр.Себестоимость > 0 Тогда 
		Стр.Цена = (Стр.Наценка/100+1)*Стр.Себестоимость;				
	Иначе 
		Стр.Наценка = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РасчетТаблица()
	Для каждого Стр Из Объект.Товары Цикл	
		Стр.Себестоимость = МойМеханизм.ПолучитьЦен(Стр.Номенклатура,Объект.Дата,Объект.КатегорияЦенЗакупочная);
		Стр.СтараяЦена = МойМеханизм.ПолучитьЦен(Стр.Номенклатура,Объект.Дата,Объект.КатегорияЦен);
		Если Стр.СтараяЦена > 0 И Стр.Себестоимость > 0 Тогда 
			Стр.СтараяНаценка = (Стр.СтараяЦена / Стр.Себестоимость - 1) * 100;
		Иначе 
			Стр.СтараяНаценка = 0;		
		КонецЕсли;
		Если Стр.Цена > 0 И Стр.Себестоимость > 0 Тогда 
			Стр.Наценка = (Стр.Цена / Стр.Себестоимость - 1) * 100;				
		Иначе 
			Стр.Наценка = 0;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
