
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Функция определяет склад по умолчанию.
//
// Возвращает склад, если найден один склад.
// Возвращает ПустуюСсылку в противном случае
Функция ПолучитьЕдиницуПоУмолчанию(Знач ЕдиницаОКЕИ = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(ЕдиницаОКЕИ) Тогда 
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	Таблица.Ссылка КАК ЕдиницаОКЕИ
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК Таблица
		|ГДЕ
		|	(НЕ Таблица.ПометкаУдаления)
		|");
		         		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
			ЕдиницаОКЕИ = Выборка.ЕдиницаОКЕИ;
		Иначе
			ЕдиницаОКЕИ = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ЕдиницаОКЕИ;
	
КонецФункции

// Функция возвращает единицу измерения Шт, по коду 796
// Если такой не найдено, то единица измерения создается по ОКЕИ 
Функция ПолучитьЕдиницуИзмеренияШтука() Экспорт
	
	ЕдиницаИзмеренияШтукаСсылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(796);	
	Если ЕдиницаИзмеренияШтукаСсылка.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
			ЕдиницаИзмеренияШтука = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			ЕдиницаИзмеренияШтука.Код = 796;
			ЕдиницаИзмеренияШтука.Наименование = "шт";
			ЕдиницаИзмеренияШтука.НаименованиеПолное = "Штука";
			ЕдиницаИзмеренияШтука.МеждународноеСокращение = "PCE";
			
			ЕдиницаИзмеренияШтука.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат ЕдиницаИзмеренияШтука.Ссылка;
	Иначе
		Возврат ЕдиницаИзмеренияШтукаСсылка;
	КонецЕсли;
	
КонецФункции