
Процедура ПередЗаписью(Отказ)
	ПроверкаИзмененияРеквизитаВесовой(Отказ);	
КонецПроцедуры

Процедура ПроверкаИзмененияРеквизитаВесовой(Отказ)
	
	Если Не ЭтоНовый() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	КлассификаторЕдиницИзмерения.Весовой
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|ГДЕ
		|	КлассификаторЕдиницИзмерения.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Выборка.Следующий();
		СтароеЗначениеРеквизита = Выборка.Весовой;	 
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Если СтароеЗначениеРеквизита <> Весовой Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.ЕдиницаИзмерения = &ЕдиницаИзмерения";
			
			Запрос.УстановитьПараметр("ЕдиницаИзмерения", Ссылка);
			РезультатЗапроса = Запрос.Выполнить(); 					
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Сообщение = Новый СообщениеПользователю;
				ТекстСообщения = "Единица измерения """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
    			|Признак весовой не может быть изменен!";   				
				Отказ = Истина; 				
				
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();   
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;    	      	
		
КонецПроцедуры
