
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РсПоступления.Тест(Объект);	
КонецПроцедуры

&НаСервере
Процедура РсСумма()	
	Для каждого Товар Из Объект.Товары Цикл	
		Товар.Сумма = Товар.Количество * Товар.Цена;		
	КонецЦикла;
КонецПроцедуры // ()

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РсПоступления.Тест(Объект);	
КонецПроцедуры

&НаСервере
Процедура РасчетТовар()
	Для каждого Товар Из Объект.Товары Цикл	
		Товар.Сумма = Товар.Количество * Товар.Цена;		
	КонецЦикла;
КонецПроцедуры // РасчетТовар()

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ИспХарак();	
	СуммаДокумент = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	//ТоварыНоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспХарак()	
	Для каждого Товар Из Объект.Товары Цикл	
		//Товар.ИспХарактерестика = Товар.Номенклатура.Продукция;		
		Товар.ИспользованиеХарактеристик = Товар.Номенклатура.ИспользоватьХарактеристикиНоменклатуры;		
	КонецЦикла;
КонецПроцедуры // ()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ИспХарак();\
	Для каждого ТекСтрока Из СписокПартии Цикл
		ТекСтрока.Значение.ПолучитьОбъект().Удалить();
	КонецЦикла;
	СписокПартии.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ИспХарак();
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИспХарак();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Для каждого ТекСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
		Если Не ПустаяСтрока(Объект.Товары.НайтиПоИдентификатору(ТекСтрока).ПартияНоменклатура) Тогда
			//НовыйМассив = Новый Массив;
			//НовыйМассив.Добавить(Объект.Товары.НайтиПоИдентификатору(ТекСтрока).ПартияНоменклатура);
			СписокПартии.Добавить(Объект.Товары.НайтиПоИдентификатору(ТекСтрока).ПартияНоменклатура);
			//УдалитьПартииНоменклатура();	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда 
		Отказ = Истина
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СуммаДокумент = Объект.Товары.Итог("Сумма");
	Если Объект.Проведен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

