Процедура ПроверитьЭлемент(Наимен, Элемент, Отказ) Экспорт
    // Проверяем совпадение наименования
    Отбор = Наимен;
    Найдено = Справочники[Элемент.Метаданные().Имя].НайтиПоНаименованию(Отбор, Истина);
	Если Найдено = Справочники[Элемент.Метаданные().Имя].ПустаяСсылка() Тогда
        // Сообщить("1-Такого элемента нет");
        // Перезаписываем элемент справочника
        Отказ = Ложь;
    ИначеЕсли Найдено.Код = Элемент.Код Тогда
        // Сообщить("2-Это редактир	уемый элемент");
        // Перезаписываем элемент справочника
        Отказ = Ложь;
    Иначе
        // Сообщить("3-Такой элемент уже есть в справочнике");
        // Запрещаем запись этого элемента
        Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьШтрихКод(Наимен, Элемент, Отказ) Экспорт
	Структура = Новый Структура(Наимен);
	Выборка = Справочники.Номенклатура.Выбрать(,,Структура);
	Пока Выборка.Следующий() Цикл	
		Выборка.ШтрихКод = Наимен;						
	КонецЦикла;
	
	// Проверяем совпадение наименования
    Отбор = Наимен;
    Найдено = Справочники[Элемент.Метаданные().Имя].НайтиПоНаименованию(Отбор, Истина);
    Если Найдено = Справочники[Элемент.Метаданные().Имя].ПустаяСсылка() Тогда
        // Сообщить("1-Такого элемента нет");
        // Перезаписываем элемент справочника
        Отказ = Ложь;
    ИначеЕсли Найдено.Код = Элемент.Код Тогда
        // Сообщить("2-Это редактируемый элемент");
        // Перезаписываем элемент справочника
        Отказ = Ложь;
    Иначе
        // Сообщить("3-Такой элемент уже есть в справочнике");
        // Запрещаем запись этого элемента
        Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Функция ПроверитьСтатусНоменклатура(Номенклатура)Экспорт

	Возврат Номенклатура.Статус;	

КонецФункции // ()

Функция ПараметрыСеансаТекущийПользователь() Экспорт
    Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
КонецФункции

Функция ПолучитТипОрганизация() Экспорт 
	Возврат Константы.ТипОрганизация.Получить();	
КонецФункции // ()

&НаКлиенте
Процедура ОткФорма() Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ТипОрганизация");	
	
КонецПроцедуры
