
&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере("serv.indenim.info",82,"Admin","12");
	//Команда1НаСервере("infostart.ru",,,);
	//https://infostart.ru/upload/iblock/7d0/7d0c2e828b2305d19269d128d8b97a44.png
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере(Сервер, Порт, Ползователь, Парол)
	Соединение = Новый HTTPСоединение(Сервер,Порт,Ползователь,Парол);	
	Запрос = Новый HTTPЗапрос("/secretbase/hs/serv/dist");
	//Запрос = Новый HTTPЗапрос("/upload/iblock/7d0/7d0c2e828b2305d19269d128d8b97a44.png");
	НовыйЗипФайл = ПолучитьИмяВременногоФайла("zip");
	Фай = "C:\git\goods.zip";
	//Фйл = Новый Файл("C:\git\dd.zip");
	//двДанние = Новый ДвоичныеДанные(Фай);
	Резултат = Соединение.Получить(Запрос);
	URI = Резултат.Заголовки.Получить("Location");
	
	
	//URI = СтруктураURI(Резултат.Заголовки.Получить("Location"));
 
        // Делаем новое подключение и get запрос.
 
    Ответ = Соединение.Получить(Резултат.Заголовки.Получить("Location"),Фай);
	
	Архив = Новый ЧтениеZipФайла(Фай,"");
	Архив.ИзвлечьВсе("c:\git",РежимВосстановленияПутейФайловZIP.Восстанавливать);
	
	f = 0;
	
	
КонецПроцедуры
