
&НаКлиенте
Процедура ОтборДата()
	Список.Отбор.Элементы.Очистить();
	ОтборДатаНачала = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДатаНачала.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ОтборДатаНачала.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборДатаНачала.ПравоеЗначение = НачалоДня(НачДата);
	ОтборДатаНачала.Использование = Истина;
	
	ОтборДатаОкончания = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДатаОкончания.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	ОтборДатаОкончания.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборДатаОкончания.ПравоеЗначение = КонецДня(КонцДата - 86400);
	ОтборДатаОкончания.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачДата = НачалоДня(ТекущаяДата());
	КонцДата = НачДата + 86400;
	ОтборДата();
	СписокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	НачДата = НачалоДня(ТекущаяДата());
	КонцДата = НачДата + 86400;
	ОтборДата();
КонецПроцедуры

&НаКлиенте
Процедура Передеюший(Команда)
	НачДата = НачДата - 86400;
	КонцДата = КонцДата - 86400;
	ОтборДата();
КонецПроцедуры

&НаКлиенте
Процедура Следующый(Команда)
	НачДата = НачДата + 86400;
	КонцДата = КонцДата + 86400;
	ОтборДата();
КонецПроцедуры

&НаКлиенте
Процедура НачДатаПриИзменении(Элемент)
	ОтборДата();
КонецПроцедуры

&НаКлиенте
Процедура КонцДатаПриИзменении(Элемент)
	ОтборДата();
КонецПроцедуры

&НаКлиенте
Процедура ФирмаларБуйича(Команда)
	Список.Группировка.Элементы.Очистить();
	Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")).Поле = Новый ПолеКомпоновкиДанных("РасчётныйСчёт.Владелец");	
КонецПроцедуры

&НаКлиенте
Процедура Очистит(Команда)
	Список.Группировка.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СписокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюта.Ссылка
	|ИЗ
	|	Справочник.Валюта КАК Валюта";
	Выборка = Запрос.Выполнить().Выбрать();
	Остатка = 0;
	Пока Выборка.Следующий() Цикл
		//Остатка = МеханизмОбщие.БалансОбщие(Выборка.Ссылка) - МеханизмОбщие.БалансБанковскийСчет(Выборка.Ссылка) + Остатка;
		Остатка = МеханизмОбщие.БалансОбщие(Выборка.Ссылка) + Остатка;
		//Сообщить(Строка(Выборка.Ссылка) + Строка(МеханизмОбщие.БалансОбщие(Выборка.Ссылка)));
	КонецЦикла;
	Инфо = Остатка;
КонецПроцедуры


&НаКлиенте
Процедура Сформироват(Команда)
СписокПриИзмененииНаСервере();	
КонецПроцедуры


&НаКлиенте
Процедура СоздатСДатом(Команда)
	Форма = ПолучитьФорму("Документ.КассовыеОперации.Форма.ФормаДокумента",,ЭтаФорма);
	Форма.Объект.Дата = ПРДата;
	Форма.Открыть();
КонецПроцедуры

