//// Получает по Номенклатуре и Харктеристике Себестоимость для всей ТЧ из регистра ЦеныНоменклатуры (категория цен - Закупочная). Результат помещает во ВТ "ТаблицаССебестоимостью"
////
////Параметры:
//// МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит ВТ ТаблицаБезСтоимости с колонками НомерСтроки, Номенклатура и ХарактеристикаНоменклатуры 
//// Дата - Дата - Период
//// Склад - СправочникСсылка.Склады 
//// Валюта - ВВалютаДокумента ( по умолчанию - валюта управленческого учета)
////
////Возвращаемое значение:
////ТаблицаССебестоимостью  - ВТ с колонками НомерСтроки и Себестоимость 
//Функция ПолучитьЗакупочныеЦеныВоВсейТЧ(МенеджерВременныхТаблиц, Дата, КатегорияЦенЗакупочная, Валюта = Неопределено) Экспорт
//	
//	ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
//	
//	ВалютаЗакупочная 	= ОбщегоНазначенияДУМВызовСервера.ЗначениеРеквизитаОбъекта(КатегорияЦенЗакупочная, "ВалютаЦены");
//	ВалютаЗакупочная    = ?(ЗначениеЗаполнено(ВалютаЗакупочная), ВалютаЗакупочная, ВалютаУправленческогоУчета);
//	Валюта 				= ?(ЗначениеЗаполнено(Валюта), Валюта, ВалютаУправленческогоУчета);
//	
//	ПересчитатьСебестоимостьВВалюту = Ложь;
//	Если ВалютаЗакупочная <> Валюта Тогда
//		ПересчитатьСебестоимостьВВалюту = Истина;
//	КонецЕсли;	
//	
//	ДанныеВалютыЗакупочная  = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаЗакупочная, Дата);
//	ДанныеВалютыДокумента   = МодульВалютногоУчета.ПолучитьКурсВалюты(Валюта        , Дата);	 
//	ДанныеВалютыУпр         = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУправленческогоУчета        , Дата);	 
//	
//	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ТаблицаБезСебестоимости.Номенклатура,
//	|	ТаблицаБезСебестоимости.ХарактеристикаНоменклатуры,
//	|	ВЫБОР
//	|		КОГДА &ПересчитатьСебестоимостьВВалюту
//	|			ТОГДА ВЫРАЗИТЬ(СебестоимостьДляПереоценкиСрезПоследних.Цена * &КурсВалютыЗак / &КурсВалютыДокумента * &КратностьВалютыДокумента / &КратностьВалютыЗак КАК ЧИСЛО(15, 2))
//	|		ИНАЧЕ СебестоимостьДляПереоценкиСрезПоследних.Цена
//	|	КОНЕЦ КАК Себестоимость,
//	|	СебестоимостьДляПереоценкиСрезПоследних.Регистратор КАК Регистратор
//	|ПОМЕСТИТЬ СебестоимостьНоменклатуры
//	|ИЗ
//	|	ТаблицаБезСебестоимости КАК ТаблицаБезСебестоимости
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
//	|				&Дата, КатегорияЦен = &КатегорияЦен И 
//	|				Номенклатура В
//	|					(ВЫБРАТЬ
//	|						ТаблицаБезСебестоимости.Номенклатура
//	|					ИЗ
//	|						ТаблицаБезСебестоимости КАК ТаблицаБезСебестоимости)) КАК СебестоимостьДляПереоценкиСрезПоследних
//	|		ПО ТаблицаБезСебестоимости.Номенклатура = СебестоимостьДляПереоценкиСрезПоследних.Номенклатура И (НЕ ТаблицаБезСебестоимости.Номенклатура.ЦенаЗадаетсяНаХарактеристику ИЛИ ТаблицаБезСебестоимости.ХарактеристикаНоменклатуры = СебестоимостьДляПереоценкиСрезПоследних.ХарактеристикаНоменклатуры)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаБезСебестоимости.Номенклатура,
//	|	ТаблицаБезСебестоимости.ХарактеристикаНоменклатуры,
//	|	МАКСИМУМ(ПлановаяСтоимостьПродукцииСрезПоследних.Период) КАК МаксимальныйПериод
//	|ПОМЕСТИТЬ ВТПоследниеДатыСтоимостьПродукции
//	|ИЗ
//	|	ТаблицаБезСебестоимости КАК ТаблицаБезСебестоимости
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяСтоимостьПродукции.СрезПоследних(
//	|				&Дата,
//	|				(Номенклатура, ХарактеристикаНоменклатуры) В
//	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|							ТаблицаБезСебестоимости.Номенклатура,
//	|							ВЫБОР
//	|								КОГДА ТаблицаБезСебестоимости.Номенклатура.ЦенаЗадаетсяНаХарактеристику
//	|									ТОГДА ТаблицаБезСебестоимости.ХарактеристикаНоменклатуры
//	|								ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|							КОНЕЦ
//	|						ИЗ
//	|							ТаблицаБезСебестоимости КАК ТаблицаБезСебестоимости)
//	|					И (ТорговыйОбъект.КатегорияЦенЗакупочная = &КатегорияЦен
//	|						ИЛИ ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.ТорговыеОбъекты.ПустаяСсылка))) КАК ПлановаяСтоимостьПродукцииСрезПоследних
//	|		ПО ТаблицаБезСебестоимости.Номенклатура = ПлановаяСтоимостьПродукцииСрезПоследних.Номенклатура
//	|			И ВЫБОР
//	|				КОГДА ТаблицаБезСебестоимости.Номенклатура.ЦенаЗадаетсяНаХарактеристику
//	|					ТОГДА ТаблицаБезСебестоимости.ХарактеристикаНоменклатуры
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|			КОНЕЦ = ПлановаяСтоимостьПродукцииСрезПоследних.ХарактеристикаНоменклатуры
//	|ГДЕ
//	|	ТаблицаБезСебестоимости.Номенклатура.Продукция
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаБезСебестоимости.Номенклатура,
//	|	ТаблицаБезСебестоимости.ХарактеристикаНоменклатуры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТПоследниеДатыСтоимостьПродукции.Номенклатура,
//	|	ВТПоследниеДатыСтоимостьПродукции.ХарактеристикаНоменклатуры,
//	|	МАКСИМУМ(ВЫБОР
//	|			КОГДА &ПересчитатьСебестоимостьВВалюту
//	|				ТОГДА ВЫРАЗИТЬ(ПлановаяСтоимостьПродукции.Стоимость * &КурсВалютыУпр / &КурсВалютыДокумента * &КратностьВалютыДокумента / &КратностьВалютыУпр КАК ЧИСЛО(15, 2))
//	|			ИНАЧЕ ПлановаяСтоимостьПродукции.Стоимость
//	|		КОНЕЦ) КАК СтоимостьПлан
//	|ПОМЕСТИТЬ ВТСтоимостьПродукции
//	|ИЗ
//	|	ВТПоследниеДатыСтоимостьПродукции КАК ВТПоследниеДатыСтоимостьПродукции
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяСтоимостьПродукции КАК ПлановаяСтоимостьПродукции
//	|		ПО ВТПоследниеДатыСтоимостьПродукции.Номенклатура = ПлановаяСтоимостьПродукции.Номенклатура
//	|			И ВЫБОР
//	|				КОГДА ВЫРАЗИТЬ(ВТПоследниеДатыСтоимостьПродукции.Номенклатура КАК Справочник.Номенклатура).ЦенаЗадаетсяНаХарактеристику
//	|					ТОГДА ВТПоследниеДатыСтоимостьПродукции.ХарактеристикаНоменклатуры
//	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	|			КОНЕЦ = ПлановаяСтоимостьПродукции.ХарактеристикаНоменклатуры
//	|			И ВТПоследниеДатыСтоимостьПродукции.МаксимальныйПериод = ПлановаяСтоимостьПродукции.Период
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТПоследниеДатыСтоимостьПродукции.Номенклатура,
//	|	ВТПоследниеДатыСтоимостьПродукции.ХарактеристикаНоменклатуры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СебестоимостьНоменклатуры.Номенклатура,
//	|	СебестоимостьНоменклатуры.ХарактеристикаНоменклатуры,
//	|	МАКСИМУМ(ЕСТЬNULL(ВТСтоимостьПродукции.СтоимостьПлан, ЕСТЬNULL(СебестоимостьНоменклатуры.Себестоимость, 0) + ВЫБОР
//	|				КОГДА &ПересчитатьСебестоимостьВВалюту
//	|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(СебестоимостьРаспределенияРасходов.Стоимость, 0) * &КурсВалютыУпр / &КурсВалютыДокумента * &КратностьВалютыДокумента / &КратностьВалютыУпр КАК ЧИСЛО(15, 2))
//	|				ИНАЧЕ ЕСТЬNULL(СебестоимостьРаспределенияРасходов.Стоимость, 0)
//	|			КОНЕЦ)) КАК Себестоимость
//	|ПОМЕСТИТЬ Группировка_ТаблицаССебестоимостью
//	|ИЗ
//	|	СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьРаспределенияРасходов КАК СебестоимостьРаспределенияРасходов
//	|		ПО (СебестоимостьНоменклатуры.Регистратор = СебестоимостьРаспределенияРасходов.ПриходныйДокумент)
//	|			И (СебестоимостьНоменклатуры.Номенклатура = СебестоимостьРаспределенияРасходов.Номенклатура) И СебестоимостьНоменклатуры.ХарактеристикаНоменклатуры = СебестоимостьРаспределенияРасходов.ХарактеристикаНоменклатуры
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтоимостьПродукции КАК ВТСтоимостьПродукции
//	|		ПО СебестоимостьНоменклатуры.Номенклатура = ВТСтоимостьПродукции.Номенклатура
//	|			И СебестоимостьНоменклатуры.ХарактеристикаНоменклатуры = ВТСтоимостьПродукции.ХарактеристикаНоменклатуры
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	СебестоимостьНоменклатуры.Номенклатура,
//	|	СебестоимостьНоменклатуры.ХарактеристикаНоменклатуры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Группировка_ТаблицаССебестоимостью.Себестоимость,
//	|	ТаблицаБезСебестоимости.*
//	|ПОМЕСТИТЬ ТаблицаССебестоимостью
//	|ИЗ
//	|	ТаблицаБезСебестоимости КАК ТаблицаБезСебестоимости
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Группировка_ТаблицаССебестоимостью КАК Группировка_ТаблицаССебестоимостью
//	|		ПО ТаблицаБезСебестоимости.Номенклатура = Группировка_ТаблицаССебестоимостью.Номенклатура
//	|			И ТаблицаБезСебестоимости.ХарактеристикаНоменклатуры = Группировка_ТаблицаССебестоимостью.ХарактеристикаНоменклатуры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Группировка_ТаблицаССебестоимостью
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТСтоимостьПродукции
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВТПоследниеДатыСтоимостьПродукции
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ СебестоимостьНоменклатуры
//	|;";
//	
//	Запрос.УстановитьПараметр("ПересчитатьСебестоимостьВВалюту", 	ПересчитатьСебестоимостьВВалюту);
//	Запрос.УстановитьПараметр("КурсВалютыЗак", 					    ДанныеВалютыЗакупочная.Курс);
//	Запрос.УстановитьПараметр("КурсВалютыДокумента", 				ДанныеВалютыДокумента.Курс);
//	Запрос.УстановитьПараметр("КурсВалютыУпр", 					    ДанныеВалютыУпр.Курс);
//	Запрос.УстановитьПараметр("КратностьВалютыЗак", 				ДанныеВалютыЗакупочная.Кратность);
//	Запрос.УстановитьПараметр("КратностьВалютыДокумента", 			ДанныеВалютыДокумента.Кратность);
//	Запрос.УстановитьПараметр("КратностьВалютыУпр",      			ДанныеВалютыУпр.Кратность);
//	Запрос.УстановитьПараметр("КатегорияЦен", 						КатегорияЦенЗакупочная);
//	Запрос.УстановитьПараметр("Дата", 								Дата);
//	
//	Запрос.Выполнить();
//	//Результат = ОбщегоНазначенияДУМ.ПолучитьДанныеВременнойТаблицы(МенеджерВременныхТаблиц, "ВТСтоимостьПродукции");
//	
//КонецФункции	

//// Получает себестоимость номенклатуры из регистра ЦеныНоменклатуры (категория цен - Закупочная) для номенклатуры по складу. 
//// Если склад не заполнен, берется себестоимость по складу, на который был последний приход.
//// Если в 1 секунду несколько записей аналитик, то берется максимальная себестоимость 
////
//Функция ПолучитьЗакупочнуюЦенуДляПереоценки (Номенклатура, ХарактеристикаНоменклатуры, Дата, КатегорияЦенЗакупочная, Валюта = Неопределено, ЕдиницаИзмерения = Неопределено) Экспорт
//	
//	ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
//	
//	ВалютаЗакупочная = ОбщегоНазначенияДУМВызовСервера.ЗначениеРеквизитаОбъекта(КатегорияЦенЗакупочная, "ВалютаЦены");
//	Валюта 			 = ?(ЗначениеЗаполнено(Валюта), Валюта, Константы.ВалютаУправленческогоУчета.Получить());
//		
//	КоэффициентЕдиницыИзмерения = ?(ЗначениеЗаполнено(ЕдиницаИзмерения), ЕдиницаИзмерения.Коэффициент, 1);
//	ЦенаЗадаетсяНаХарактеристику = ?(ЗначениеЗаполнено(Номенклатура), ОбщегоНазначенияДУМВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура, "ЦенаЗадаетсяНаХарактеристику"), Ложь);
//		
//	Если ЗначениеЗаполнено(Валюта)  И Валюта <> ВалютаЗакупочная Тогда
//		Коэффициенты = МодульВалютногоУчета.ПолучитьКоэффициентыПересчетаВалюты(Валюта, ВалютаЗакупочная, Дата);
//		КоэффициентПересчетаЗакВВалютуДокумента = 1 / Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов;
//		КоэффициентПересчетаУпрВВалютуДокумента = 1 / Коэффициенты.КоэффициентПересчетаВВалютуУпр;
//		
//	Иначе
//		КоэффициентПересчетаЗакВВалютуДокумента = 1;	
//		КоэффициентПересчетаУпрВВалютуДокумента = 1;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 

//	"ВЫБРАТЬ
//	|	ПлановаяСтоимостьПродукцииСрезПоследних.Период КАК Период,
//	|	ПлановаяСтоимостьПродукцииСрезПоследних.Стоимость КАК Стоимость
//	|ПОМЕСТИТЬ ВТДанныеСебестоимостиПродукции
//	|ИЗ
//	|	РегистрСведений.ПлановаяСтоимостьПродукции.СрезПоследних(
//	|			&Дата,
//	|			Номенклатура = &Номенклатура
//	|				И (НЕ &ЦенаЗадаетсяНаХарактеристику
//	|					ИЛИ ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры)
//	|				И (ТорговыйОбъект.КатегорияЦенЗакупочная = &КатегорияЦен
//	|					ИЛИ ТорговыйОбъект = ЗНАЧЕНИЕ(Справочник.ТорговыеОбъекты.ПустаяСсылка))) КАК ПлановаяСтоимостьПродукцииСрезПоследних
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МАКСИМУМ(ВТДанныеСебестоимостиПродукции.Период) КАК ПоследнийПериод
//	|ПОМЕСТИТЬ ВТПоследниеДатыСебестоимости
//	|ИЗ
//	|	ВТДанныеСебестоимостиПродукции КАК ВТДанныеСебестоимостиПродукции
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВЫРАЗИТЬ(ВЫБОР
//	|			КОГДА МАКСИМУМ(ВТДанныеСебестоимостиПродукции.Стоимость) ЕСТЬ НЕ NULL 
//	|				ТОГДА МАКСИМУМ(ВТДанныеСебестоимостиПродукции.Стоимость) * &КоэффициентПересчетаУпрВВалютуДокумента
//	|			ИНАЧЕ ЕСТЬNULL(МАКСИМУМ(СебестоимостьДляПереоценки.Цена), 0) * &КоэффициентПересчетаЗакВВалютуДокумента + ЕСТЬNULL(МАКСИМУМ(СебестоимостьРаспределенияРасходов.Стоимость), 0) * &КоэффициентПересчетаУпрВВалютуДокумента
//	|		КОНЕЦ * &КоэффициентЕдиницыИзмерения КАК ЧИСЛО(15, 2)) КАК Стоимость
//	|ИЗ
//	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
//	|			&Дата,
//	|			Номенклатура = &Номенклатура
//	|				И (НЕ &ЦенаЗадаетсяНаХарактеристику
//	|					ИЛИ ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры)
//	|				И КатегорияЦен = &КатегорияЦен) КАК СебестоимостьДляПереоценки
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьРаспределенияРасходов КАК СебестоимостьРаспределенияРасходов
//	|		ПО СебестоимостьДляПереоценки.Регистратор = СебестоимостьРаспределенияРасходов.ПриходныйДокумент
//	|			И СебестоимостьДляПереоценки.Номенклатура = СебестоимостьРаспределенияРасходов.Номенклатура
//	|			И СебестоимостьДляПереоценки.ХарактеристикаНоменклатуры = СебестоимостьРаспределенияРасходов.ХарактеристикаНоменклатуры
//	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТПоследниеДатыСебестоимости КАК ВТПоследниеДатыСебестоимости
//	|		ПО ИСТИНА
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеСебестоимостиПродукции КАК ВТДанныеСебестоимостиПродукции
//	|		ПО (ВТПоследниеДатыСебестоимости.ПоследнийПериод = ВТДанныеСебестоимостиПродукции.Период)";
//	
//	Запрос.УстановитьПараметр("Номенклатура"							, Номенклатура);
//	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры"				, ХарактеристикаНоменклатуры);
//	Запрос.УстановитьПараметр("Дата"									, Дата);
//	Запрос.УстановитьПараметр("КоэффициентЕдиницыИзмерения"				, КоэффициентЕдиницыИзмерения);
//	Запрос.УстановитьПараметр("КоэффициентПересчетаЗакВВалютуДокумента"	, КоэффициентПересчетаЗакВВалютуДокумента); 
//	Запрос.УстановитьПараметр("КоэффициентПересчетаУпрВВалютуДокумента"	, КоэффициентПересчетаУпрВВалютуДокумента); 
//    Запрос.УстановитьПараметр("КатегорияЦен"                          	, КатегорияЦенЗакупочная);	
//	Запрос.УстановитьПараметр("ЦенаЗадаетсяНаХарактеристику"			, ЦенаЗадаетсяНаХарактеристику);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Себестоимость = Выборка.Стоимость;		
//	Иначе
//		Себестоимость = 0;
//	КонецЕсли;
//	Возврат Себестоимость;
//КонецФункции	

//	
