
Процедура УдалитьДублиПоИзмерениям()
	
	Если Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Период      = ЭтотОбъект[0].Период;
	
	ТабНоменклатуры = Выгрузить(, "КатегорияЦен, Номенклатура, ХарактеристикаНоменклатуры, Цена");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период"         , Период);
	Запрос.УстановитьПараметр("ТабНоменклатуры", ТабНоменклатуры);
	Запрос.УстановитьПараметр("Регистратор",     ЭтотОбъект.Отбор.Регистратор.Значение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабНоменклатуры.Номенклатура,
	|	ТабНоменклатуры.ХарактеристикаНоменклатуры,
	|	ТабНоменклатуры.КатегорияЦен,
	|	ТабНоменклатуры.Цена
	|ПОМЕСТИТЬ ТабНоменклатуры
	|ИЗ
	|	&ТабНоменклатуры КАК ТабНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатуры.КатегорияЦен
	|ПОМЕСТИТЬ НоменклатураИзРегистра
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Период = &Период
	|	И ЦеныНоменклатуры.Регистратор <> &Регистратор
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТабНоменклатуры.Номенклатура,
	|	ТабНоменклатуры.ХарактеристикаНоменклатуры,
	|	ТабНоменклатуры.КатегорияЦен,
	|	ТабНоменклатуры.Цена
	|ИЗ
	|	ТабНоменклатуры КАК ТабНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураИзРегистра КАК НоменклатураИзРегистра
	|		ПО (НоменклатураИзРегистра.Номенклатура = ТабНоменклатуры.Номенклатура)
	|			И (НоменклатураИзРегистра.ХарактеристикаНоменклатуры = ТабНоменклатуры.ХарактеристикаНоменклатуры)
	|			И (НоменклатураИзРегистра.КатегорияЦен = ТабНоменклатуры.КатегорияЦен)";
	
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	&Регистратор КАК Регистратор,
		|	ТабНоменклатуры.Номенклатура,
		|	ТабНоменклатуры.ХарактеристикаНоменклатуры,
		|	ТабНоменклатуры.КатегорияЦен,
		|	ТабНоменклатуры.Цена
		|ИЗ
		|	ТабНоменклатуры КАК ТабНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураИзРегистра КАК НоменклатураИзРегистра
		|		ПО (НоменклатураИзРегистра.Номенклатура = ТабНоменклатуры.Номенклатура)
		|			И (НоменклатураИзРегистра.ХарактеристикаНоменклатуры = ТабНоменклатуры.ХарактеристикаНоменклатуры)
		|			И (НоменклатураИзРегистра.КатегорияЦен = ТабНоменклатуры.КатегорияЦен)
		|ГДЕ
		|	НоменклатураИзРегистра.Номенклатура ЕСТЬ NULL ";

		Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("НеЗаписыватьДублиПоИзмерениям") Тогда
		УдалитьДублиПоИзмерениям();
	КонецЕсли;
	
КонецПроцедуры

