
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Номенклатура = ОбщегоНазначенияДУМ.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "Владелец");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", ПараметрКоманды);
	ПараметрыФормы.Вставить("СформироватьНовый", Истина);
	
	ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаЗаписи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
		
КонецПроцедуры
