
////////////////////////////////////////////////////////////////////////////////
// РАБОТА СО ШТРИХКОДАМИ ТОВАРОВ

// Функция вычисляет контрольный символ кода EAN
//
// Параметры:
//  ШтрихКод     - штрих-код (без контрольной цифры)
//  Тип          - тип штрих-кода: 13 - EAN13, 8 - EAN8
//
// Возвращаемое значение:
//  Контрольный символ штрих-кода
//
Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если НЕ ((Тип = 8) и (Индекс = КоличествоИтераций)) Тогда
			Четн = Четн + Число(Сред(ШтрихКод, 2 * Индекс, 1));
		КонецЕсли;
		Нечетн = Нечетн + Число(Сред(ШтрихКод, 2 * Индекс - 1, 1));
	КонецЦикла;

	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции // КонтрольныйСимволEAN()

// Проверка штрих-кода на корректность
//
// Параметры:
//  ШтрихКод     - проверяемый штрих-код;
//  ТипШтрихкода - элемент плана видов характеристик "ТипыШтрихкодов", содержит тип
//                 проверяемого штрих-кода.
//
// Возвращаемое значение:
//  Истина если штрих код корректен, иначе Ложь
//
//Функция ПроверитьШтрихКод(ШтрихКод, ТипШтрихкода) Экспорт

//	ДлинаКода = СтрДлина(Штрихкод);

//	Если ДлинаКода = 0 Тогда
//		Возврат Ложь;
//	КонецЕсли;
//	
//	Если ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.EAN13") Тогда
//		
//		Если (ДлинаКода <> 13)
//		 Или НЕ(СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Штрихкод)) // штрих-код должен состоять из цифр
//		 Или КонтрольныйСимволEAN(Лев(Штрихкод,12), 13) <> Прав(Штрихкод, 1) Тогда
//			Возврат Ложь;
//		КонецЕсли;
//		
//	ИначеЕсли ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.EAN8") Тогда
//		
//		Если (ДлинаКода <> 8)
//		 Или НЕ(СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Штрихкод)) // штрих-код должен состоять из цифр
//		 Или КонтрольныйСимволEAN(Лев(Штрихкод, 7), 8) <> Прав(Штрихкод, 1) Тогда
//			Возврат Ложь;
//		КонецЕсли;
//		
//	ИначеЕсли ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.Code39") Тогда
//		
//		Условие = СтрДлина(ШтрихКод) - 1;
//		Для Индекс = 0 По Условие Цикл
//			Символ = Лев(Прав(Штрихкод, Условие - Индекс + 1), 1);
//			Если НЕ (((Символ >= "0") И (Символ <= "9"))
//				ИЛИ	((Символ >= "A") И (Символ <= "Z"))
//				ИЛИ (Символ = "-")
//				ИЛИ (Символ = ".")
//				ИЛИ (Символ = " ")
//				ИЛИ (Символ = "$")
//				ИЛИ (Символ = "/")
//				ИЛИ (Символ = "+")
//				ИЛИ (Символ = "%")
//				ИЛИ (Символ = "*")) Тогда
//				Возврат Ложь;
//			КонецЕсли
//		КонецЦикла;
//		
//	ИначеЕсли ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.Code128")
//		  ИЛИ ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.EAN128") Тогда
//		
//		Условие = СтрДлина(ШтрихКод) - 1;
//		Для Индекс = 0 По Условие Цикл
//			Если КодСимвола(ШтрихКод, Индекс) > 127 Тогда
//				Возврат Ложь;
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Возврат Истина;
//	
//КонецФункции // ПроверитьШтрихКод()

// Функция осуществляет формирование нового внутреннего штрих-кода для
// штучного товара
//
// Параметры
//  Код        – Измерение "Код" регистра сведений ШтрихкодыНоменклатуры,
//  ФорматШК   - формат формируемого ШК,
//  Количество - количество, с которым формируется штрих-код
//
// Возвращаемое значение:
//  <Строка>
//       – сформированный штрих-код
//
Функция СформироватьШтрихКодСКоличеством(Код, ФорматШК, Количество) Экспорт

	Сч = 0;
	ТекКод = СтрЗаменить(Код, Символы.НПП,"");
	
	ТекКод = ""+ТекКод;
	Пока СтрДлина(ТекКод) < 5 Цикл
		ТекКод = "0" + ТекКод;
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(ФорматШК.Префикс) Тогда
		Штрихкод = "20" + ТекКод;
	Иначе
		Штрихкод = "" + ФорматШК.Префикс + ТекКод;
	КонецЕсли;
	
	Штрихкод = Штрихкод + СтрЗаменить(Формат(Количество / ФорматШК.МножительКоличества, "ЧЦ=5; ЧВН="), Символы.НПП,"");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);

	Возврат Штрихкод;

КонецФункции // СформироватьШтрихКод()
 